[
  {
    "role": "Head of Decision Science & Product",
    "company": "Montai Therapeutics",
    "summary": "Orchestrated AI product adoption (ChatGPT for org; Claude Code for technical team), driving enablement and repeatable workflows. Acted as key IC+ contributor for applied AI product prototypes and agentic workflows (orchestration, guardrails, evaluation loops). Standardized executive decision UX and briefing patterns used for multi-million-dollar R&D trade-offs.",
    "range": "2025 - Present"
  },
  {
    "role": "Data Research Lead",
    "company": "Montai Therapeutics",
    "summary": "Owned the end-to-end nomination product sourcing 10K+ compounds per run; redesigned UX, data model, and pipeline to cut cycle time by ~90% and make it the default tool for HTS campaigns. Designed a dbt/S3 warehouse reducing compute cost by ~$75k/yr and shortening analytics turnaround by ~75%. Built exec-ready dashboards used in ~3 portfolio reviews/quarter, guiding $10M+ R&D investment decisions. Integrated predictive modeling into early-stage gates, improving progression precision by ~20% and reducing false positives by ~15%. Product-managed PEAK (institutional knowledge system) from concept to adoption across 6+ discovery teams.",
    "range": "2022 - 2025"
  },
  {
    "role": "Data Scientist",
    "company": "Replica Analytics",
    "summary": "Built R/Python pipelines to clean and validate clinical datasets, improving reliability for research and analysis. Applied ML models to patient data to generate insights supporting clinical trial evidence. Contributed to privacy-preserving synthetic data innovation enabling secure healthcare data sharing.",
    "range": "2019 - 2020"
  },
  {
    "role": "Chief Analytics Officer",
    "company": "ArchitecHealth",
    "summary": "Directed analytics strategy for small-to-medium biotech firms, informing portfolio and research decisions. Oversaw delivery of analytics projects that produced actionable insights and improved client competitiveness.",
    "range": "2018 - 2019"
  }
]
